Revit 2027 API
PipeFlowConfigurationType Enumeration
 An enumerated type listing all connector flow configuration
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum PipeFlowConfigurationType
Public Enumeration PipeFlowConfigurationType
public enum class PipeFlowConfigurationType
type PipeFlowConfigurationType
Members
Member name | Value | Description
Calculated | 0 |  Flow configuration is calculated
Demand | 3 |  Flow configuration depends on demand
Preset | 1 |  Flow configuration is Preset
System | 2 |  Flow configuration depends on system
See Also
Reference
Autodesk.Revit.DB.Plumbing Namespace